In [2]:
import pandas as pd

In [4]:
data={
     "departments":["HR","DevOp","technical","HR","DevOp","technical"],
    "emp":["evaarah","vamika","vedika","raha","shraddha","sakshi"],
    "salary":[10000,120030,346000,450000,167800,347900],
    "bonus":[3500,4500,6500,3420,1230,3780]
    }
df=pd.DataFrame(data)
df

  departments       emp  salary  bonus
0          HR   evaarah   10000   3500
1       DevOp    vamika  120030   4500
2   technical    vedika  346000   6500
3          HR      raha  450000   3420
4       DevOp  shraddha  167800   1230
5   technical    sakshi  347900   3780

In [10]:
df2=df.groupby("departments")["salary"].max()
df2

departments
DevOp        167800
HR           450000
technical    347900
Name: salary, dtype: int64

In [14]:
df3=df.groupby("departments")["bonus"].sum()
df3

departments
DevOp         5730
HR            6920
technical    10280
Name: bonus, dtype: int64

In [17]:
df4=df.groupby("departments")["emp"].count()
df4

departments
DevOp        2
HR           2
technical    2
Name: emp, dtype: int64

In [18]:
df5=df[df["departments"]=="DevOps"]["emp"].count()
df5

np.int64(0)

In [15]:
import pandas as pd
import numpy as np
data={
    "departments":["HR","DevOp","technical","HR","DevOp",None],
    "emp":["evaarah","vamika","vedika",None,"shraddha","sakshi"],
    "salary":[10000,120030,346000,450000,167800,347900],
    "bonus":[np.nan,4500,6500,3420,1230,3780]
}
df6=pd.DataFrame(data)
df6

  departments       emp  salary   bonus
0          HR   evaarah   10000     NaN
1       DevOp    vamika  120030  4500.0
2   technical    vedika  346000  6500.0
3          HR      None  450000  3420.0
4       DevOp  shraddha  167800  1230.0
5        None    sakshi  347900  3780.0

In [20]:
df_drop=df6.dropna()
df_drop

  departments       emp  salary   bonus
1       DevOp    vamika  120030  4500.0
2   technical    vedika  346000  6500.0
4       DevOp  shraddha  167800  1230.0

In [29]:
df6_mean=df6[""].fillna(df6[""].mean(),inplace=True)
df6_mean

C:\Users\BHAGYASHRI JADHAV\AppData\Local\Temp\ipykernel_16156\1707778160.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df6_mean=df6["bonus"].fillna(df6["bonus"].mean(),inplace=True)

In [31]:
df7=df["salary"].mean()
df7

np.float64(240288.33333333334)